using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace FrogAnanas.Constants
{
    public static class Message
    {
        public const string START_ADVENTURE = "(Вы только недавно прохаживались по знакомым вам улицам, как вдруг небо окрасилось в кроваво-красный цвет, по всюду стали появляться разломы, из которых выходили всевозможные монстры.Множество людей погибло в считанные минуты, и уже над вами вознеслась рука огра, но внезапное сообщение остановило время. \"Поздравляем, вы \n(*номер персонажа)\n покоритель башни. Будет произведен внеплановый перенос, стартовое обеспечение рассчитала система. Удачного подъема! P.s.Ваш Фрогананас =) \"\nЗрение размылось и вы погрузились в темноту.Спустя какое-то время, стали различимы звуки и объекты, вы стоите перед входом в небольшой городок старого образца, где красуется деревянная табличка \"Греховка\"";
        public const string GREHOVKA = "Небольшой городок в центре Российской тайги. Двух-трех этажные здания занимают почти все пространство и только узенькие улочки позволяют спокойно перемещаться по нему. Не будь здесь огромной башни и высоких стен, закрывающих город от внешнего мира, то его вполне можно было бы принять за самый обычный заброшенный поселок городского типа.";
        public const string TOWER = "Центр Греховки это  безумно высокая цилиндрическая башня, местами похожая на огромную копию пезанской башни, выполненной в оттенках черного и бордового цветов. Мощные створчатые врата башни, обрамленные крупными переплетениями кровавого шиповника, так и манят своей таинственной энергетикой.\n\nНедалеко от этих врат стоит небольшой пропускной пункт, где стоит таинственная постройка, образующая своего рода дыру в пространстве.";
        public const string BAR = "Бар тети Гали это двухэтажное здание изрисованное разноцветными графити. Вход закрывает неработающая дверь подъезда.\nСамо помещение достаточно просторное со старыми деревянными столиками и табуретами.В правом углу от входа стоит старый грамофон, который наигрывает мелодии минувших дней.Возле дальней стены стоит барная стойка, за которой стоит грузная женщина лет 40, которая все время занята протиранием стаканов.";
        public const string MARKET = "Одно из самым популярных мест в Греховке, у кого есть копейки или хабар из башни. Посреди большинства палаток рыночного района, главным образом выделяется деревянная халупка с вывеской \" У Саныча \".\nЗа хлипкой дверцей находится коридор, ведущий в центральную часть, казалось бы снаружи, маленькой лачуги.Проходя мима стелажей с разнообразными, не всегда понятными и таинственными предметами вы выходите к стойке, за которой сидит маленький старичок, которого все зовут Санычем.";
        public const string GO_BACK_TOWN = "Вы идете по пути, отмеченном специальным мелком, который использует каждый авантюрист, и выходите прямо к порталу, который переносит вас обратно ко входу в башню около пропускного пункта";
        public const string ENTER_TOWER = "Пройдя сквозь терновые врата вы чувствуете, что реальный мир остался позади, а впереди только страх, боль и несметные богатства с полчищами монстров.\nРазмыленое зрение восстанавливается после перехода и вы можете разглядеть окружающую вас обстановку.\n\n\n( *дальше идет описание этажа)";
        public const string ENTER_STAGE_TOWER = "Вы подходите к порталу, который находится недалеко от пропускного пункта башни. Сообщив нужный вам этаж, заведующий порталом Александр Михайлович, набирает нужную комбинацию символов. Дыра в пространстве на короткое время становится нестабильной, постепенно отображая в себе знакомые черты присущие данному ареалу обитания.\nСтабилизировав портал, вам дан знак, что вы можете проходить.Очертания пропускново пункта размываются и вот уже вы оказываетесь в \n\n\n(*Описание выбранного этажа башни)";
        public const string MSG = "";
    }
}
